Animal_Shelter_Backend/app/controllers/dogs_controller.rb

SELECT "dogs".* FROM "dogs"
---
    def index
        dogs = Dog.all